frontend/models/Lang.php

    public static function getDefaultLang()
    {
        return self::findOne(['default' => 1]);
---
SELECT * FROM `lang` WHERE `default`=1

    public static function getLangByUrl($url = null)
    {
        if ($url === null) {
            return null;
        }

        $language = self::findOne(['url' => $url]);
---
SELECT * FROM `lang` WHERE `url`='sprites'