frontend/widgets/Lang.php

SELECT * FROM `lang` WHERE id != 1
---
    public function run() {
        return $this->render('lang/view', [
            'currentLang' => LangModel::getCurrent(),
            'langs' => LangModel::find()
                ->where('id != :current_id', [':current_id' => LangModel::getCurrent()->id])
                ->all()